Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-IT/tmx_teil_2.tmx
Source language: en
Languages: it

source: Spray lances for attachment to pressure washing machines for cleaning purposes
it: Lance a spruzzo da attaccare a macchine per lavaggio a pressione per scopi di pulizia

source: Rotary paper trimming machines, other than for office use
it: Taglierine-raffilatrici rotanti, non per ufficio

source: Automatic lathes
it: Torni automatici

source: Automatic swimming pool sweepers
it: Spazzole automatiche per piscine

source: Gas engines
it: Motori a gas

source: Gas generators [compressors] for undersea lifting
it: Generatori di gas [compressori] per sollevamento sottomarino

source: Industrial printing machines
it: Macchine da stampa industriali

source: Pelletizer blades being parts of machines
it: Pale di pellettizzazione che sono parti di macchine

source: Paint stripping apparatus [machines]
it: Apparecchi per togliere la pittura [macchine]

source: Pallet transferring machines
it: Macchine di trasferimento pallet

source: Sound absorbers [silencers] being parts of exhaust systems for machines
it: Assorbenti acustici [silenziatori] che sono parti di sistemi di scarico per macchine

source: Keyhole saws [machines]
it: Seghe a gattuccio [macchine]

source: Knife cleaning machines
it: Macchine per pulire coltelli

source: Centrifugal separators
it: Separatori centrifughi

source: Textile milling machines
it: Macchine tessili per follatura

source: Calender rollers [machines]
it: Rulli di calandratura [macchine]

source: Camshafts for machines
it: Alberi a camme per macchine

source: Capping machines for aerosols
it: Macchine per tappare flaconi aerosol

source: Radiators for vehicles
it: Radiatori per veicoli

source: Axles for machines
it: Alberi di macchine

source: Yarn singeing machines
it: Macchine per gazare fili

source: Shredders [machines] for industrial use
it: Macchine per tranciare per uso industriale

source: Piston segments
it: Anelli di pistoni

source: Valves [parts of machines]
it: Valvole [parti di macchine]

source: Milling grinding motors
it: Motori mola per frese

source: Machines for handling nuclear fuels
it: Macchine per trattare combustibili nucleari

source: Compressed air hoists
it: Argani ad aria compressa

source: Compressed air pilot valves
it: Valvole pilota ad aria compressa

source: Machine coupling and transmission components, except for land vehicles, and parts therefor
it: Giunti e organi di trasmissione per usi diversi da quelli per veicoli terrestri e relativi componenti

source: Machines for the production of semiconductors
it: Macchine per la fabbricazione di semiconduttori

source: Machines for separating recyclable materials
it: Macchine di separazione dei materiali riciclabili

source: Pressure reducers [parts of machines]
it: Riduttori di pressione [parti di macchine]

source: Reducing gears [parts of machines]
it: Demoltiplicatori [parti di macchine]

source: Portable drill stands for electric drills
it: Supporti portatili per trapani elettrici

source: Portable filtration units [machines]
it: Unità di filtraggio trasportabili [macchine]

source: Loaders [machines]
it: Caricatori [macchine]

source: Mortising machines
it: Macchine per bulinare

source: Air pumps [garage installations]
it: Pompe ad aria [installazioni di garages]

source: Chaff cutter blades [parts of machines]
it: Lame di trinciapaglia [parti di macchine]

source: Cutting inserts for machine tools
it: Inserti da taglio per macchine utensili

source: Shredders [machines] for cardboard
it: Trituratori [macchine] per cartone

source: Manifolds [parts of engines]
it: Collettori [parti di motori]

source: Barley splitting machines
it: Macchine per suddividere l'orzo

source: Actuating mechanisms for operating aircraft flaps
it: Meccanismi di azionamento per manovrare flap di aeromobili

source: Actuators for mechanisms
it: Azionatori per meccanismi

source: Robots for welding
it: Robot per saldatura

source: Sand-blasting apparatus
it: Apparecchi per sabbiatura

source: Mobile electrical power generators
it: Generatori mobili di energia elettrica

source: Machines for sealing containers
it: Macchine per sigillare recipienti

source: Machines for shredding scrap
it: Macchine trituratrici per rottami

source: Machines for tapping threads
it: Macchine per filettatura

source: Milling machines for the treatment of ceramics and metal
it: Fresatrici per il trattamento di ceramica e metallo

source: Vending machines (Counter operated -)
it: Distributori automatici (A moneta -)

source: Scarifiers [earth moving machines]
it: Scarificatori [macchine movimento terra]

source: Centrifuges
it: Centrifughe

source: Vertical turbine pumps
it: Pompe a turbina verticali

source: Servomotors incorporating encoders
it: Servomotori con codificatori incorporati

source: Tillers [agricultural implements]
it: Motocoltivatori [strumenti agricoli]

source: Air filters for mechanical purposes
it: Filtri dell'aria per uso meccanico

source: Carbon brushes [electricity]
it: Spazzole di carbone [elettricità]

source: Cigarette machines for industrial purposes
it: Macchine per sigarette per uso industriale

source: Hydraulic hammers
it: Martelli idraulici

source: Pistons for machines
it: Pistoni per macchine

source: Metal cutting centres [machines]
it: Centri di taglio dei metalli [macchine]

source: Spring motors
it: Motori a molla

source: Gear wheels for machines
it: Ruote dentate per macchine

source: Air blowing machines
it: Macchine soffianti aria

source: Casings for industrial machines
it: Alloggiamenti per macchine industriali

source: Dashpot plungers [parts of engines or motors]
it: Pistoni di ammortizzatori [parti di motori]

source: Deburring machines
it: Macchine sbavatrici

source: Decanter centrifuges incorporating screw conveyors
it: Decantatori centrifughi con convogliatori a coclea

source: Deionizing machines
it: Macchine deionizzatrici

source: Suction machines for industrial purposes
it: Macchine di aspirazione per uso industriale

source: Brushes being parts of dynamos
it: Spazzole che sono parti di dinamo

source: Screens used in the paper industry [parts of machines]
it: Schermi utilizzati nell'industria cartaria [parti di macchine]

source: Vacuum cleaners for industrial purposes
it: Aspirapolvere per uso industriale

source: Boiler tubes [parts of machines]
it: Tubi per caldaie [parti di macchine]

source: Vacuum cleaner attachments for disseminating perfumes and disinfectants
it: Accessori per aspirapolvere per spargere profumi e disinfettanti

source: Vacuum cleaner hoses
it: Tubi per aspirapolvere

source: Vacuum cleaners
it: Aspirapolvere

source: Sand sorting machines
it: Separatori per sabbia

source: Contour grinding machines
it: Macchine contornatrici

source: Cutters for silage [other than hand-operated tools]
it: Dispositivi da taglio per silaggio [non utensili a mano]

source: Shaving exhaust installations
it: Impianti di scarico per trucioli

source: Shearing machines (Hand-operated -)
it: Cesoie (ad azionamento manuale)

source: Printing machines for use on sheet metal
it: Macchine per la stampa su lamiera

source: Shock absorbing springs for machines
it: Molle ammortizzatrici per macchine

source: Shovel loaders [machines]
it: Pale caricatrici [macchine]

source: Precision grinding machines
it: Rettificatrici di precisione

source: Servo-cutters [machines]
it: Guidalama [macchine]

source: Servomotors [other than for land vehicles]
it: Servomotori [non per veicoli terrestri]

source: Pneumatic drills
it: Trapani pneumatici

source: Pneumatic pumps for the supply of liquefied gases
it: Pompe pneumatiche per la fornitura di gas liquefatti

source: Pipes [fitted parts of machines]
it: Tubi [parti adattate di macchine]

source: Stapling machines [other than for surgical or stationery use]
it: Cucitrici a punti metallici [non per uso chirurgico o per cartoleria]

source: Fan belts for motors and engines
it: Cinghie di ventilatori per motori

source: Power transmissions and gearing for machines [not for land vehicles]
it: Trasmissioni di potenza e ingranaggi per macchine [non per veicoli terrestri]

source: Trolling plate for propeller driven watercrafts
it: Piastre per la pesca a traina per imbarcazioni ad elica

source: Power installations [generators]
it: Impianti di potenza [generatori]

source: Multi-phase screw pumps
it: Pompe multifase a vite

source: Steam condensers [parts of machines]
it: Condensatori di vapore [parti di macchine]

source: Apparatus for aerating beverages
it: Apparecchi per gasare le bevande

source: Rotary presses [for textiles]
it: Presse rotative [per tessuti]

source: Centrifugal machines
it: Centrifughe [macchine]

source: Centrifugal mills
it: Mulini centrifughi

source: Labelling machines [other than for office use]
it: Applicatori di etichette [non per ufficio]

source: Lamination coating machines other than for office use
it: Macchine di rivestimento di laminazione non per ufficio

source: Laundry presses
it: Presse per bucato

source: Catalytic converters being parts of vehicle exhausts
it: Convertitori catalitici che sono parti di marmitte di veicoli

source: Cattle stunning appliances [machines]
it: Apparecchi per stordire il bestiame [macchine]

source: Centrifugal machines for use with milk
it: Centrifughe per uso con il latte

source: Meat cutters [electric machines]
it: Tagliacarne [macchine elettriche]

source: Mechanical power transmitting mechanisms [other than for land vehicles]
it: Meccanismi meccanici di trasmissione di potenza [non per veicoli terrestri]

source: Mechanical stamping tools [parts for machines]
it: Utensili meccanici per stampaggio [parti di macchine]

source: Abrasive grinding wheels [tools for machines]
it: Mole abrasive [utensili per macchine]

source: Cocks [valves] of metal parts of machines
it: Rubinetti [valvole] in metallo parti di macchine

source: Machines for dyeing textiles
it: Macchine per la tintura di tessuti

source: Cutting tools for use in powered hand-held tools
it: Utensili da taglio per utensili elettrici manuali

source: Cylinder covers [parts of machines]
it: Coperchi di cilindri [parti di macchine]

source: Cylinders for use in printing machines
it: Cilindri per uso con macchine per la stampa

source: Diesel engines for air vehicles
it: Motori diesel per veicoli aerei

source: Differential gear mechanisms for machines
it: Meccanismi a ingranaggi differenziali per macchine

source: Milling tools [parts for machines]
it: Utensili di fresatura [parti di macchine]

source: Tube cutting machines
it: Macchine tagliatubi

source: Turbine blades treated with alloys
it: Pale di turbine trattate con leghe

source: Flap discs for power-operated grinders
it: Dischi lamellari per molatrici a motore

source: Vegetable washers [machines]
it: Lavaverdure [macchine]

source: Transmissions for water vehicles
it: Trasmissioni per veicoli nautici

source: Cranes [lifting and hoisting apparatus]
it: Gru [apparecchi di sollevamento]

source: Generators for wind turbines
it: Generatori per turbine eoliche

source: Granulating machines [for chemical processing]
it: Granulatrici [per trattamento chimico]

source: Wind turbines
it: Turbine eoliche

source: Moulds [parts of machines]
it: Stampi [parti di macchine]

source: Coin-operated washing machines
it: Lavatrici a gettone o a moneta

source: Heat pumps [parts of machines]
it: Pompe di calore [parti di macchine]

source: Hydraulic accumulators
it: Accumulatori idraulici

source: Hydraulic actuators
it: Azionatori idraulici

source: Hydraulic pumps
it: Pompe idrauliche

source: Belt conveyors having a totally curved axis
it: Trasportatori a nastro ad asse totalmente curvo

source: Machine fly-wheels
it: Volanti di macchine

source: Electric meat slicers for kitchen use
it: Affettatrici elettriche da cucina per carne

source: Safety valves [parts of machines]
it: Valvole di sicurezza [parti di macchine]

source: Rotary cutting installations [machines]
it: Impianti di sfogliatura rotativa [macchine]

source: Dividing machines
it: Divisori [macchine]

source: Waste gas conduits [parts of machines]
it: Condotte per gas di scarico [parti di macchine]

source: Articulated transmissions for machines
it: Trasmissioni articolate per macchine

source: Disc sanding machines
it: Smerigliatrici a disco

source: Copper tubes [parts of machines]
it: Tubi di rame [parti di macchine]

source: Hoses (Metal -) for use in hydraulic systems in machines
it: Tubi flessibili (In metallo -) per impianti idraulici di macchine

source: Spice grinders (Electric -)
it: Macinini per spezie (Elettrici -)

source: Spiked rollers [machines] for use in soil aeration
it: Rulli a spuntoni [macchine] per aerazione del suolo

source: Pistons for land vehicle engines
it: Pistoni per motori di veicoli terrestri

source: Seed drills [parts of machines]
it: Seminatrici a file [parti di macchine]

source: Segmental saw blades for machines
it: Lame di seghe a segmenti per macchine

source: Self-centring chucks [parts of machines]
it: Mandrini autocentranti [parti di macchine]

source: Self-driven machines for drilling
it: Macchine autoguidate per trivellazione

source: Blowing machines for the compression, sucking and carrying of grain
it: Soffierie per la compressione, l'aspirazione ed il trasporto del grano

source: Radial drills
it: Trapani radiali

source: Bending machines for sheets
it: Macchine curvatrici per lastre

source: Impact drills [machines or parts of machines]
it: Trapani a percussione [macchine o parti di macchine]

source: Steam boilers [parts of machines]
it: Caldaie a vapore [parti di macchine]

source: Drainage machines
it: Macchine di drenaggio

source: Machines for the production of mineral water
it: Apparecchi per la fabbricazione di acque minerali

source: Vacuum control valves [parts of engines]
it: Valvole di controllo del vuoto [parti di motori]

source: Valve assemblies of metal [parts of machines]
it: Insiemi di valvole in metallo [parti di macchine]

source: Industrial soldering machines [gas operated]
it: Macchine industriali per saldatura [a gas]

source: Industrial squeezers
it: Spremitrici industriali

source: Suction fans for the compression of grain
it: Aspiratori per la compressione di granaglie

source: Mounted bearings [parts of machines]
it: Cuscinetti montati [parti di macchine]

source: Electric propulsion mechanisms for water vehicles
it: Meccanismi di propulsione elettrici per veicoli nautici

source: Sprayers [machines] for agricultural use in spraying insecticides
it: Nebulizzatori [macchine] per uso agricolo per spruzzare insetticidi

source: Cordless electric drills
it: Trapani elettrici senza filo

source: Power-operated nailing guns
it: Chiodatrici elettriche

source: Blade holders [parts of machines]
it: Porta-lame [parti di macchine]

source: Machines for cleaning surfaces using high pressure water
it: Macchine per pulire superfici mediante acqua ad alta pressione

source: Electrical pumps
it: Pompe elettriche

source: Electric ignition apparatus for internal combustion engines
it: Apparecchi elettrici di accensione per motori a combustione interna

source: Spray fittings [parts of machines]
it: Accessori a spruzzo [parti di macchine]

source: Agitators
it: Agitatori

source: Stop valves of plastic [parts of machines]
it: Valvole di arresto in plastica [parti di macchine]

source: Timing belt pulleys [parts of engines]
it: Pulegge per cinghie dentate [parti di motori]

source: Needle pistols [machines]
it: Pistole ad ago [macchine]

source: Non-return flaps of metal [parts of machines]
it: Paratoie di non ritorno in metallo [parti di macchine]

source: Auto sheet laminating machines
it: Laminatrici a foglio automatico

source: Pumps for the extraction of gases [machines]
it: Pompe per l'estrazione di gas [macchine]

source: Punching presses for the final punching of parts
it: Presse punzonatrici per la punzonatura finale di componenti

source: Punching tools [electric], other than for office use
it: Utensili per punzonatura [elettrici], non per ufficio

source: Machines for excavating earth
it: Macchine escavatrici per la terra

source: Drive pulleys for power transmission belts of industrial machines
it: Pulegge motrici per cinghie di trasmissione per macchine industriali

source: Percussion hammers [machines]
it: Martelli a percussione [macchine]

source: Industrial centrifuges
it: Centrifughe industriali

source: Rocket motor propulsion apparatus for missiles
it: Apparecchi di propulsione a motore a razzo per missili

source: Rocket propulsion engines for weapons
it: Motori di propulsione a razzo per armamenti

source: Flexible jacks (Power operated -)
it: Martinetti flessibili (Elettrici -)

source: Modular couplings for machine tools
it: Giunti modulari per macchine utensili

source: System control instruments (Mechanical -)
it: Strumenti per il controllo di sistemi (Meccanici -)

source: Taper shank bits [parts of machines]
it: Punte a codolo conico [parti di macchine]

source: Tapping valves for metallurgical purposes
it: Valvole di spillatura per la metallurgia

source: Garden rollers [machines]
it: Rulli da giardino [macchine]

source: Electrical motor pump units
it: Gruppi motopompa elettrici

source: Packing installations
it: Impianti di imballaggio

source: Brushes for vacuum cleaners
it: Spazzole per aspirapolveri

source: Single shouldered beading machines
it: Macchine bordatrici a spalla singola

source: Leather tanning machines
it: Macchine per la concia

source: Rotary pumps
it: Pompe rotative

source: Electric vacuum cleaners and their components
it: Aspirapolveri elettrici e relativi componenti

source: Electrical apparatus for sealing plastics [packaging]
it: Apparecchi elettrici per saldare imballaggi in materie plastiche

source: Electroplating machines
it: Macchine per galvanoplastica

source: Anti-kickback devices for power tools
it: Dispositivi antiritorno per utensili elettrici

source: Spraying booms for towing behind vehicles for spraying crops
it: Barre irroranti da trainare dietro a veicoli per irrorare coltivazioni

source: Sprays [machines], other than for medical use
it: Nebulizzatori [macchine], non per uso medico

source: Stamping machines for printed materials in sheet form
it: Macchine di stampaggio per materiali stampati in fogli

source: Quilting machines for use in the manufacture of mattresses
it: Trapuntatrici per la fabbricazione di materassi

source: Ram air turbines [other than for land vehicles]
it: Turbine a presa dinamica [non per veicoli terrestri]

source: Workpiece carriers [machines]
it: Caricatori portapezzi [macchine]

source: Workpiece carriers [parts of machines]
it: Caricatori portapezzi [parti di macchine]

source: Aerial platforms for use with cranes
it: Piattaforme aeree da utilizzare con gru

source: Crushing machines for industrial purposes
it: Frantumatrici per uso industriale

source: Hand held power operated spraying machines
it: Spruzzatrici manuali ad azionamento elettrico

source: Wet wheel abrasive cutters [machines]
it: Frese a disco abrasivo a umido [macchine]

source: Power-operated lifts for moving, parking and storing land vehicles
it: Elevatori a motore per muovere, parcheggiare e immagazzinare veicoli terrestri

source: Power-operated lubricant dispensers for machines
it: Distributori elettrici di lubrificanti per macchinari

source: Power-operated ratchet wrenches
it: Chiavi a cricchetto elettriche

source: Power-operated rivet guns
it: Ribaditrici a motore

source: Compressed air guns for the extrusion of mastics
it: Pistole ad aria compressa per l'estrusione di mastici

source: Generators
it: Generatori

source: Drive chains for driving aircraft
it: Catene di trasmissione per pilotare aerei

source: Igniting magnetos
it: Magneti d'accensione

source: Machines for washing laboratory apparatus
it: Macchine per lavare apparecchi da laboratorio

source: Magnetic brakes for machines
it: Freni magnetici per macchine

source: Magnetic clamps [parts of machines]
it: Morsetti magnetici [parti di macchine]

source: Utensils (Electric -) for stirring liquids
it: Utensili (Elettrici -) per mescolare liquidi

source: Refrigerated vending machines
it: Distributori automatici refrigerati

source: Numerically controlled modelling machines for home use
it: Macchine modellatrici a controllo numerico per uso domestico

source: Meat choppers [machines]
it: Tritacarne [macchine]

source: Pruning saws [motorised]
it: Seghe da potatura [a motore]

source: Steam hammers [machines]
it: Magli a vapore [macchine]

source: Steering linkages for machines
it: Tiranterie dello sterzo per macchine

source: Spindles for machine tools
it: Mandrini per macchine utensili

source: Spiral mixing machines
it: Impastatrici a spirale

source: Blade sharpening [stropping] machines
it: Macchine per l'affilatura delle lame

source: Machines for printing textile materials
it: Macchine per la stampa di materiali tessili

source: Buckets for use with hydraulic lifting machines
it: Benne per macchine idrauliche di sollevamento

source: Electrofusion welding machines
it: Saldatrici a elettrofusione

source: Mowing buckets [machines or parts of machines]
it: Benne falcianti [macchine o parti di macchine]

source: Injection moulds
it: Stampi a iniezione

source: Installations for automated washing of vehicles
it: Installazioni per il lavaggio automatizzato di veicoli

source: Installations for the bulk handling of pulverulent materials
it: Impianti per la movimentazione di materiali polverulenti sfusi

source: Gravity conveyors [machines]
it: Trasportatori a gravità [macchine]

source: Grinding machines for refacing the edges of tools
it: Macchine per molatura per rettificare bordi di utensili

source: Orange juice extracting machines [electric]
it: Centrifughe spremisucchi per arance [elettriche]

source: Orbital sanders [machines]
it: Levigatrici orbitali [macchine]

source: Industrial conveyors
it: Trasportatori industriali

source: Industrial cutting machines
it: Tagliatrici industriali

source: Motor driven tools
it: Utensili a motore

source: Motor hoes [machines]
it: Motocoltivatori [macchine]

source: Atomizers [machines] for insecticides
it: Polverizzatori [macchine] per insetticidi

source: Spray lances being horticultural implements
it: Lance di spruzzo che sono attrezzi orticoli

source: Spray rollers being horticultural implements
it: Rulli spruzzatori che sono strumenti orticoli

source: Pressure pumps
it: Pompe a pressione

source: Threaders [machines]
it: Infila aghi [macchine]

source: Tilling implements for agricultural use
it: Strumenti di coltura per uso agricolo

source: Mobile aerial work platforms [electric]
it: Piattaforme di lavoro aeree mobili [elettriche]

source: Mobile aerial work platforms [hydraulic]
it: Piattaforme di lavoro aeree mobili [idrauliche]

source: Mobile machines for quarrying
it: Macchine mobili per estrazione

source: Fans being parts of machines
it: Ventole che sono parti di macchine

source: Feeders for machines
it: Alimentatori per macchine

source: Axial pumps
it: Pompe assiali

source: Gas generators [compressors] for inflating rigid structures
it: Generatori di gas [compressori] per gonfiare strutture rigide

source: Soundproof hoods [parts of machines]
it: Carter insonorizzati [parti di macchine]

source: Mincing machines [electric] for industrial use
it: Macchine per tritare [elettriche] per uso industriale

source: Joints for tubes (metal -) [parts of engines]
it: Raccordi per tubature (in metallo -) [parti di motori]

source: Centrifugal grinding machines
it: Macchine di molatura a centrifuga

source: Elevating platforms for attachment to vehicles
it: Piattaforme di elevazione da attaccare a veicoli

source: Agricultural elevators
it: Elevatori per l'agricoltura

source: Engraving machines
it: Macchine per incidere
